#define NUM_OBJECTS 0x5C6

typedef enum { //type:u16
	ObjDefEnum_SkyDome = 0x61F,
	ObjDefEnum_ProjectileS = 0x1D3,
	ObjDefEnum_WCSunDoor = 0x51F,
	ObjDefEnum_ARWArwingGu_0615 = 0x615,
	ObjDefEnum_GF_DoorLeft = 0x770,
	ObjDefEnum_WCTrexStatu = 0x510,
	ObjDefEnum_LINKPoleFla = 0x20B,
	ObjDefEnum_DR_Seqobj = 0x3B6,
	ObjDefEnum_CCSharpclaw = 0xB1,
	ObjDefEnum_SB_ShipGunB = 0x5A1,
	ObjDefEnum_AnimGreatfo = 0x73D,
	ObjDefEnum_SB_DeckDoor = 0x173,
	ObjDefEnum_IMAnimSpace = 0x168,
	ObjDefEnum_MSPlantingS = 0x54C,
	ObjDefEnum_hologramhaz = 0x62E,
	ObjDefEnum_ARWSeqObjec = 0x6D4,
	ObjDefEnum_iceblast = 0x4EC,
	ObjDefEnum_LFweaponT1 = 0x6F1,
	ObjDefEnum_LFweaponT2 = 0x6F2,
	ObjDefEnum_SB_ShipMast = 0xF8,
	ObjDefEnum_ThusterSour = 0x758,
	ObjDefEnum_AnimSpell = 0x361,
	ObjDefEnum_CRSpellston = 0x390,
	ObjDefEnum_CCgasvent = 0x5AC,
	ObjDefEnum_DR_CloudDoo_0474 = 0x474,
	ObjDefEnum_SpiritDoorS = 0x795,
	ObjDefEnum_TrickyGuard = 0x440,
	ObjDefEnum_WM_largeroc = 0x2B7,
	ObjDefEnum_DIMAlpineRo_0319 = 0x319,
	ObjDefEnum_SmallBasket = 0x3CF,
	ObjDefEnum_DR_HighDoor = 0x489,
	ObjDefEnum_FrontEndLog = 0x665,
	ObjDefEnum_KP_textbloc_0595 = 0x595,
	ObjDefEnum_KP_textbloc_0594 = 0x594,
	ObjDefEnum_KP_textbloc_0596 = 0x596,
	ObjDefEnum_DIM_LevelCo = 0x312,
	ObjDefEnum_WallAnimato = 0x160,
	ObjDefEnum_hazesphere = 0x6CA,
	ObjDefEnum_LINKSnowLog = 0x211,
	ObjDefEnum_DFP_PowerSl = 0x82F,
	ObjDefEnum_ECSH_Pressu = 0x66F,
	ObjDefEnum_SC_DummyCir = 0x7D2,
	ObjDefEnum_WM_NoPassHo = 0x28C,

	ObjDefEnum_CommandMenu = 0x65E,
	ObjDefEnum_WCAnimGoldT = 0x52B,
	ObjDefEnum_GF_LevelCon = 0x71E,
	ObjDefEnum_VFP_LevelCo = 0x2FF,
	ObjDefEnum_YellowFernF = 0x6B1,
	ObjDefEnum_KP_RedKrazo = 0x598,
	ObjDefEnum_SC_blTarget = 0x883,
	ObjDefEnum_FireCrawler_0869 = 0x869,
	ObjDefEnum_SPEggSmall = 0x45F,
	ObjDefEnum_DFP_Platfor = 0x4F9,
	ObjDefEnum_WCPressureS = 0x50E,
	ObjDefEnum_SH_queenear = 0x158,
	ObjDefEnum_WhiteFernFl = 0x6B0,
	ObjDefEnum_WCMoonTempl_0528 = 0x528,
	ObjDefEnum_BlueFernFlo = 0x6AF,
	ObjDefEnum_VFP_corepla = 0x3CB,
	ObjDefEnum_DFP_RotateP = 0x498,
	ObjDefEnum_smallfern = 0x798,
	ObjDefEnum_DR_Collapse = 0x4BC,
	ObjDefEnum_DR_Tower = 0x6D0,
	ObjDefEnum_LargeCrate = 0x49F,
	ObjDefEnum_SC_totemstr = 0x39C,
	ObjDefEnum_CmbSrcTPole = 0x7A8,
	ObjDefEnum_NW_guardian = 0x148,
	ObjDefEnum_EnergyGem1 = 0x9,
	ObjDefEnum_VFP_corepla_055F = 0x55F,
	ObjDefEnum_DR_Chimmey = 0x470,
	ObjDefEnum_BossDarkorF = 0x70B,
	ObjDefEnum_TrickyQuest = 0x17C,
	ObjDefEnum_CFPowerRoom = 0x11E,
	ObjDefEnum_CCfireCryst_00A8 = 0xA8,
	ObjDefEnum_NW_InfoText_081D = 0x81D,
	ObjDefEnum_CNTcounter = 0x6BB,
	ObjDefEnum_BossDrakor = 0x2AB,
	ObjDefEnum_SnowFruitTr = 0x625,
	ObjDefEnum_WM_WarpPoin = 0x265,
	ObjDefEnum_BlueMushroo_0169 = 0x169,
	ObjDefEnum_SH_krystalH = 0x16E,
	ObjDefEnum_FXEmit = 0xD4,
	ObjDefEnum_ARWArwingBo_0606 = 0x606,
	ObjDefEnum_VFP_seqpoin = 0x3BD,
	ObjDefEnum_WORLDanimpl = 0x7F6,
	ObjDefEnum_LINKSnowGra = 0x214,
	ObjDefEnum_Animscaless = 0x85D,
	ObjDefEnum_VariableObj = 0x443,
	ObjDefEnum_CF_MovDeckD = 0x332,
	ObjDefEnum_CNTColideOb = 0x800,
	ObjDefEnum_TexFrameAni = 0x4A8,
	ObjDefEnum_GrassWeedCl = 0x6E5,
	ObjDefEnum_SH_staffHaz = 0x659,
	ObjDefEnum_LINKC_seqob = 0x19A,
	ObjDefEnum_Weevil = 0x369,
	ObjDefEnum_DR_LandSqua = 0x4C8,
	ObjDefEnum_NW_ice3 = 0x567,
	ObjDefEnum_CRSnowBike = 0x38C,
	ObjDefEnum_NW_ice2 = 0x566,
	ObjDefEnum_NW_ice1 = 0x565,
	ObjDefEnum_FrontFox = 0x77D,
	ObjDefEnum_HoloPoint = 0x3F0,
	ObjDefEnum_WM_krazoast_078C = 0x78C,
	ObjDefEnum_SPFruitLarg = 0x460,
	ObjDefEnum_IMSnowBike = 0x72,
	ObjDefEnum_DIM_BossGut_024C = 0x24C,
	ObjDefEnum_Blue_bean = 0x3DF,
	ObjDefEnum_CFBrokenPil_079B = 0x79B,
	ObjDefEnum_Grimble = 0x2B9,
	ObjDefEnum_DIMMagicLig = 0x391,
	ObjDefEnum_DIM2IceGrat = 0xF3,
	ObjDefEnum_DIMSnowHorn_0190 = 0x190,
	ObjDefEnum_NW_alpinero = 0x116,
	ObjDefEnum_AnimRobotPa = 0x60E,
	ObjDefEnum_CCpedstal = 0xF0,
	ObjDefEnum_DR_Creator = 0x43F,
	ObjDefEnum_PortalSpell = 0x414,
	ObjDefEnum_DIMBridgeCo = 0x213,
	ObjDefEnum_KP_Transpor = 0x59A,
	ObjDefEnum_SH_YellowWh = 0x12F,
	ObjDefEnum_WCSeqObject = 0x505,
	ObjDefEnum_SkeetlaWall = 0x4AD,
	ObjDefEnum_DRPerch = 0x477,
	ObjDefEnum_DFP_RoundDo = 0x42E,
	ObjDefEnum_SC_animmusc = 0x3FF,
	ObjDefEnum_JungleTree = 0x77A,
	ObjDefEnum_CFGCsmallbl = 0x644,
	ObjDefEnum_SKYRingStor = 0x762,
} ObjDefEnum;

typedef enum { //type:u8
	ObjDefFlags4_LevelObject  = 0x1,
	ObjDefFlags4_ManualLoad   = 0x2,
    ObjDefFlags4_UsePlayerPos = 0x4,
	ObjDefFlags4_BlockObject  = 0x20,
} ObjDefFlags4;

typedef struct ObjDef {
	s16   objType;       //0x00 ObjDefEnum
	byte  allocatedSize; //0x02
	byte  mapActs1;      //0x03
	u8    loadFlags;     //0x04 RomListObjLoadFlags
	byte  mapActs2;      //0x05
	byte  bound;         //0x06
	byte  unk7;          //0x07
	vec3f pos;           //0x08
	u32   id;            //0x14 ObjUniqueId
} ObjDef;
CASSERT(sizeof(ObjDef) == 0x18, sizeof_ObjDef);

typedef struct PACKED ObjDef_Override {
	ObjDef     def;         //0x00
	ushort     seqId;       //0x18
	undefined2 unk1A;       //0x1A
	s16        defNoPlus4;  //0x1C ObjDefEnum
    byte       unk1E;       //0x1E
	byte       seqNo;       //0x1F
	byte       unk20;       //0x20
	byte       unk21;       //0x21
	byte       unk22;       //0x22
	byte       unk23;       //0x23
	byte       camFocusIdx; //0x24
	byte       unk25;       //0x25
	byte       unk26;       //0x26
	byte       unk27;       //0x27
} ObjDef_Override;
CASSERT(sizeof(ObjDef_Override) == 0x28, sizeof_ObjDef_Override);

typedef struct PACKED ObjSeqItem {
	u32 objId;  //0x00
	u16 flags;  //0x04 ObjSeqItemFlags
	u16 objDef; //0x06 ObjDefEnum
} ObjSeqItem;

typedef struct PACKED RomCurve {
	ObjDef def;    //0x00
	byte   action; //0x18
	byte   type;   //0x19
	byte   unk1A;  //0x1A
	byte   unk1B;  //0x1B
	int    idPrev; //0x1C
	int    idNext; //0x20
	int    unk24;  //0x24
	float  unk28;  //0x28
	byte   rotZ;   //0x2C
	byte   rotY;   //0x2D
	byte   rotX;   //0x2E
	byte   unk2F;  //0x2F
} RomCurve;
CASSERT(sizeof(RomCurve) == 0x30, sizeof_RomCurve);
